In [2]:
import psycopg2

### Python to Postgre SQL connection

In [3]:
# Establish a connection to the PostgreSQL database
conn = psycopg2.connect(
    host="localhost",
    database="iris",
    user="postgres",
    password="root"
)

# Create a cursor object to execute SQL statements
cursor = conn.cursor()

### table creation

In [4]:
# Define the table name and column names with their respective data types
table_name = 'data_1'
column1_name = 'Id'
column1_type = 'INTEGER'
column2_name = 'PetalLengthCm'
column2_type = 'FLOAT'
column3_name = 'PetalWidthCm'
column3_type = 'FLOAT'

# Create the table
create_table_query = f'''
    CREATE TABLE {table_name} (
        {column1_name} {column1_type},
        {column2_name} {column2_type},
        {column3_name} {column3_type}
    )
'''
cursor.execute(create_table_query)

# Commit the changes
conn.commit()

### load the dataset and create dataframe

In [6]:
import pandas as pd

df1 = pd.read_csv('../data/data_1.csv')

In [7]:
df1.head()

   Id  PetalLengthCm  PetalWidthCm
0   1            1.4           0.2
1   2            1.4           0.2
2   3            1.3           0.2
3   4            1.5           0.2
4   5            1.4           0.2

### insert the dataframe to created table

In [10]:
for row in df1.itertuples(index=False):
    insert_query = f'''
        INSERT INTO {table_name} (Id, PetalLengthCm, PetalWidthCm)
        VALUES (%s, %s, %s)
    '''
    cursor.execute(insert_query, row)
conn.commit()

### check the rows of the data table

In [11]:
cursor = conn.cursor()
# Define the table name
table_name = 'data_1'

# Select all data from the table
select_query = f"SELECT * FROM {table_name}"
cursor.execute(select_query)

# Fetch all the rows
rows = cursor.fetchall()

# Print the retrieved data
for row in rows:
    print(row)

(1, 1.4, 0.2)
(2, 1.4, 0.2)
(3, 1.3, 0.2)
(4, 1.5, 0.2)
(5, 1.4, 0.2)
(6, 1.7, 0.4)
(7, 1.4, 0.3)
(8, 1.5, 0.2)
(9, 1.4, 0.2)
(10, 1.5, 0.1)
(11, 1.5, 0.2)
(12, 1.6, 0.2)
(13, 1.4, 0.1)
(14, 1.1, 0.1)
(15, 1.2, 0.2)
(16, 1.5, 0.4)
(17, 1.3, 0.4)
(18, 1.4, 0.3)
(19, 1.7, 0.3)
(20, 1.5, 0.3)
(21, 1.7, 0.2)
(22, 1.5, 0.4)
(23, 1.0, 0.2)
(24, 1.7, 0.5)
(25, 1.9, 0.2)
(26, 1.6, 0.2)
(27, 1.6, 0.4)
(28, 1.5, 0.2)
(29, 1.4, 0.2)
(30, 1.6, 0.2)
(31, 1.6, 0.2)
(32, 1.5, 0.4)
(33, 1.5, 0.1)
(34, 1.4, 0.2)
(35, 1.5, 0.1)
(36, 1.2, 0.2)
(37, 1.3, 0.2)
(38, 1.5, 0.1)
(39, 1.3, 0.2)
(40, 1.5, 0.2)
(41, 1.3, 0.3)
(42, 1.3, 0.3)
(43, 1.3, 0.2)
(44, 1.6, 0.6)
(45, 1.9, 0.4)
(46, 1.4, 0.3)
(47, 1.6, 0.2)
(48, 1.4, 0.2)
(49, 1.5, 0.2)
(50, 1.4, 0.2)
(51, 4.7, 1.4)
(52, 4.5, 1.5)
(53, 4.9, 1.5)
(54, 4.0, 1.3)
(55, 4.6, 1.5)
(56, 4.5, 1.3)
(57, 4.7, 1.6)
(58, 3.3, 1.0)
(59, 4.6, 1.3)
(60, 3.9, 1.4)
(61, 3.5, 1.0)
(62, 4.2, 1.5)
(63, 4.0, 1.0)
(64, 4.7, 1.4)
(65, 3.6, 1.3)
(66, 4.4, 1.4)
(67, 4.5, 1.5)
(68, 4.1, 1.0)
(69, 4.5, 1.5)
(70, 3.9, 1.1)
(71, 4.8, 1.8)
(72, 4.0, 1.3)
(73, 4.9, 1.5)
(74, 4.7, 1.2)
(75, 4.3, 1.3)
(76, 4.4, 1.4)
(77, 4.8, 1.4)
(78, 5.0, 1.7)
(79, 4.5, 1.5)
(80, 3.5, 1.0)
(81, 3.8, 1.1)
(82, 3.7, 1.0)
(83, 3.9, 1.2)
(84, 5.1, 1.6)
(85, 4.5, 1.5)
(86, 4.5, 1.6)
(87, 4.7, 1.5)
(88, 4.4, 1.3)
(89, 4.1, 1.3)
(90, 4.0, 1.3)
(91, 4.4, 1.2)
(92, 4.6, 1.4)
(93, 4.0, 1.2)
(94, 3.3, 1.0)
(95, 4.2, 1.3)
(96, 4.2, 1.2)
(97, 4.2, 1.3)
(98, 4.3, 1.3)
(99, 3.0, 1.1)
(100, 4.1, 1.3)
(101, 6.0, 2.5)
(102, 5.1, 1.9)
(103, 5.9, 2.1)
(104, 5.6, 1.8)
(105, 5.8, 2.2)
(106, 6.6, 2.1)
(107, 4.5, 1.7)
(108, 6.3, 1.8)
(109, 5.8, 1.8)
(110, 6.1, 2.5)
(111, 5.1, 2.0)
(112, 5.3, 1.9)
(113, 5.5, 2.1)
(114, 5.0, 2.0)
(115, 5.1, 2.4)
(116, 5.3, 2.3)
(117, 5.5, 1.8)
(118, 6.7, 2.2)
(119, 6.9, 2.3)
(120, 5.0, 1.5)
(121, 5.7, 2.3)
(122, 4.9, 2.0)
(123, 6.7, 2.0)
(124, 4.9, 1.8)
(125, 5.7, 2.1)
(126, 6.0, 1.8)
(127, 4.8, 1.8)
(128, 4.9, 1.8)
(129, 5.6, 2.1)
(130, 5.8, 1.6)
(131, 6.1, 1.9)
(132, 6.4, 2.0)
(133, 5.6, 2.2)
(134, 5.1, 1.5)
(135, 5.6, 1.4)
(136, 6.1, 2.3)
(137, 5.6, 2.4)
(138, 5.5, 1.8)
(139, 4.8, 1.8)
(140, 5.4, 2.1)
(141, 5.6, 2.4)
(142, 5.1, 2.3)
(143, 5.1, 1.9)
(144, 5.9, 2.3)
(145, 5.7, 2.5)
(146, 5.2, 2.3)
(147, 5.0, 1.9)
(148, 5.2, 2.0)
(149, 5.4, 2.3)
(150, 5.1, 1.8)

### again the load the dataset fom postgreSQL

In [14]:
import warnings
warnings.filterwarnings(action='ignore')


load_df = pd.read_sql(f"SELECT * FROM {table_name}", conn)

In [15]:
load_df.head()

   id  petallengthcm  petalwidthcm
0   1            1.4           0.2
1   2            1.4           0.2
2   3            1.3           0.2
3   4            1.5           0.2
4   5            1.4           0.2

### Table_2

In [16]:
df2 = pd.read_csv('../data/data_2.csv')

In [17]:
df2.head()

   Id  SepalLengthCm  SepalWidthCm
0   1            5.1           3.5
1   2            4.9           3.0
2   3            4.7           3.2
3   4            4.6           3.1
4   5            5.0           3.6

In [20]:
conn = psycopg2.connect(
    host="localhost",
    database="iris",
    user="postgres",
    password="root"
)

# Create a cursor object to execute SQL statements
cursor = conn.cursor()





# Define the table name and column names with their respective data types
table_name = 'data_2'
column1_name = 'Id'
column1_type = 'INTEGER'
column2_name = 'SepalLengthCm'
column2_type = 'FLOAT'
column3_name = 'SepalWidthCm'
column3_type = 'FLOAT'

# Create the table
create_table_query = f'''
    CREATE TABLE {table_name} (
        {column1_name} {column1_type},
        {column2_name} {column2_type},
        {column3_name} {column3_type}
    )
'''
cursor.execute(create_table_query)

# Commit the changes
conn.commit()

In [21]:
for row in df2.itertuples(index=False):
    insert_query = f'''
        INSERT INTO {table_name} (Id, SepalLengthCm, SepalWidthCm)
        VALUES (%s, %s, %s)
    '''
    cursor.execute(insert_query, row)
conn.commit()

In [22]:
cursor = conn.cursor()
# Define the table name
table_name = 'data_2'

# Select all data from the table
select_query = f"SELECT * FROM {table_name}"
cursor.execute(select_query)

# Fetch all the rows
rows = cursor.fetchall()

# Print the retrieved data
for row in rows:
    print(row)

(1, 5.1, 3.5)
(2, 4.9, 3.0)
(3, 4.7, 3.2)
(4, 4.6, 3.1)
(5, 5.0, 3.6)
(6, 5.4, 3.9)
(7, 4.6, 3.4)
(8, 5.0, 3.4)
(9, 4.4, 2.9)
(10, 4.9, 3.1)
(11, 5.4, 3.7)
(12, 4.8, 3.4)
(13, 4.8, 3.0)
(14, 4.3, 3.0)
(15, 5.8, 4.0)
(16, 5.7, 4.4)
(17, 5.4, 3.9)
(18, 5.1, 3.5)
(19, 5.7, 3.8)
(20, 5.1, 3.8)
(21, 5.4, 3.4)
(22, 5.1, 3.7)
(23, 4.6, 3.6)
(24, 5.1, 3.3)
(25, 4.8, 3.4)
(26, 5.0, 3.0)
(27, 5.0, 3.4)
(28, 5.2, 3.5)
(29, 5.2, 3.4)
(30, 4.7, 3.2)
(31, 4.8, 3.1)
(32, 5.4, 3.4)
(33, 5.2, 4.1)
(34, 5.5, 4.2)
(35, 4.9, 3.1)
(36, 5.0, 3.2)
(37, 5.5, 3.5)
(38, 4.9, 3.1)
(39, 4.4, 3.0)
(40, 5.1, 3.4)
(41, 5.0, 3.5)
(42, 4.5, 2.3)
(43, 4.4, 3.2)
(44, 5.0, 3.5)
(45, 5.1, 3.8)
(46, 4.8, 3.0)
(47, 5.1, 3.8)
(48, 4.6, 3.2)
(49, 5.3, 3.7)
(50, 5.0, 3.3)
(51, 7.0, 3.2)
(52, 6.4, 3.2)
(53, 6.9, 3.1)
(54, 5.5, 2.3)
(55, 6.5, 2.8)
(56, 5.7, 2.8)
(57, 6.3, 3.3)
(58, 4.9, 2.4)
(59, 6.6, 2.9)
(60, 5.2, 2.7)
(61, 5.0, 2.0)
(62, 5.9, 3.0)
(63, 6.0, 2.2)
(64, 6.1, 2.9)
(65, 5.6, 2.9)
(66, 6.7, 3.1)
(67, 5.6, 3.0)
(68, 5.8, 2.7)
(69, 6.2, 2.2)
(70, 5.6, 2.5)
(71, 5.9, 3.2)
(72, 6.1, 2.8)
(73, 6.3, 2.5)
(74, 6.1, 2.8)
(75, 6.4, 2.9)
(76, 6.6, 3.0)
(77, 6.8, 2.8)
(78, 6.7, 3.0)
(79, 6.0, 2.9)
(80, 5.7, 2.6)
(81, 5.5, 2.4)
(82, 5.5, 2.4)
(83, 5.8, 2.7)
(84, 6.0, 2.7)
(85, 5.4, 3.0)
(86, 6.0, 3.4)
(87, 6.7, 3.1)
(88, 6.3, 2.3)
(89, 5.6, 3.0)
(90, 5.5, 2.5)
(91, 5.5, 2.6)
(92, 6.1, 3.0)
(93, 5.8, 2.6)
(94, 5.0, 2.3)
(95, 5.6, 2.7)
(96, 5.7, 3.0)
(97, 5.7, 2.9)
(98, 6.2, 2.9)
(99, 5.1, 2.5)
(100, 5.7, 2.8)
(101, 6.3, 3.3)
(102, 5.8, 2.7)
(103, 7.1, 3.0)
(104, 6.3, 2.9)
(105, 6.5, 3.0)
(106, 7.6, 3.0)
(107, 4.9, 2.5)
(108, 7.3, 2.9)
(109, 6.7, 2.5)
(110, 7.2, 3.6)
(111, 6.5, 3.2)
(112, 6.4, 2.7)
(113, 6.8, 3.0)
(114, 5.7, 2.5)
(115, 5.8, 2.8)
(116, 6.4, 3.2)
(117, 6.5, 3.0)
(118, 7.7, 3.8)
(119, 7.7, 2.6)
(120, 6.0, 2.2)
(121, 6.9, 3.2)
(122, 5.6, 2.8)
(123, 7.7, 2.8)
(124, 6.3, 2.7)
(125, 6.7, 3.3)
(126, 7.2, 3.2)
(127, 6.2, 2.8)
(128, 6.1, 3.0)
(129, 6.4, 2.8)
(130, 7.2, 3.0)
(131, 7.4, 2.8)
(132, 7.9, 3.8)
(133, 6.4, 2.8)
(134, 6.3, 2.8)
(135, 6.1, 2.6)
(136, 7.7, 3.0)
(137, 6.3, 3.4)
(138, 6.4, 3.1)
(139, 6.0, 3.0)
(140, 6.9, 3.1)
(141, 6.7, 3.1)
(142, 6.9, 3.1)
(143, 5.8, 2.7)
(144, 6.8, 3.2)
(145, 6.7, 3.3)
(146, 6.7, 3.0)
(147, 6.3, 2.5)
(148, 6.5, 3.0)
(149, 6.2, 3.4)
(150, 5.9, 3.0)

In [23]:
load_df_1 = pd.read_sql(f"SELECT * FROM {table_name}", conn)

In [24]:
load_df_1.head()

   id  sepallengthcm  sepalwidthcm
0   1            5.1           3.5
1   2            4.9           3.0
2   3            4.7           3.2
3   4            4.6           3.1
4   5            5.0           3.6

### Table_3

In [25]:
df3 = pd.read_csv('../data/data_2_2.csv')

In [26]:
df3.head()

   Id  SepalLengthCm    SepalWidthCm
0   1            5.1  Three dot Five
1   2            4.9             3.5
2   3            4.7          3.Five
3   4            4.6               3
4   5            5.0               3

In [27]:
conn = psycopg2.connect(
    host="localhost",
    database="iris",
    user="postgres",
    password="root"
)

# Create a cursor object to execute SQL statements
cursor = conn.cursor()





# Define the table name and column names with their respective data types
table_name = 'data_3'
column1_name = 'Id'
column1_type = 'INTEGER'
column2_name = 'SepalLengthCm'
column2_type = 'FLOAT'
column3_name = 'SepalWidthCm'
column3_type = 'VARCHAR(60)'

# Create the table
create_table_query = f'''
    CREATE TABLE {table_name} (
        {column1_name} {column1_type},
        {column2_name} {column2_type},
        {column3_name} {column3_type}
    )
'''
cursor.execute(create_table_query)

# Commit the changes
conn.commit()

In [28]:
for row in df3.itertuples(index=False):
    insert_query = f'''
        INSERT INTO {table_name} (Id, SepalLengthCm, SepalWidthCm)
        VALUES (%s, %s, %s)
    '''
    cursor.execute(insert_query, row)
conn.commit()

In [29]:
cursor = conn.cursor()
# Define the table name
table_name = 'data_3'

# Select all data from the table
select_query = f"SELECT * FROM {table_name}"
cursor.execute(select_query)

# Fetch all the rows
rows = cursor.fetchall()

# Print the retrieved data
for row in rows:
    print(row)

(1, 5.1, 'Three dot Five')
(2, 4.9, '3.5')
(3, 4.7, '3.Five')
(4, 4.6, '3')
(5, 5.0, '3')
(6, 5.4, 'Three')
(7, 4.6, 'Three.five')
(8, 5.0, 'THREE Five')
(9, 4.4, '3.$')
(10, 4.9, '3.1')
(11, 5.4, '3.7')
(12, 4.8, '3.4')
(13, 4.8, '3')
(14, 4.3, '3')
(15, 5.8, '4')
(16, 5.7, '4.4')
(17, 5.4, '3.9')
(18, 5.1, '3.5')
(19, 5.7, '3.8')
(20, 5.1, '3.8')
(21, 5.4, '3.4')
(22, 5.1, '3.7')
(23, 4.6, '3.6')
(24, 5.1, '3.3')
(25, 4.8, '3.4')
(26, 5.0, '3')
(27, 5.0, '3.4')
(28, 5.2, '3.5')
(29, 5.2, '3.4')
(30, 4.7, '3.2')
(31, 4.8, '3.1')
(32, 5.4, '3.4')
(33, 5.2, '4.1')
(34, 5.5, '4.2')
(35, 4.9, '3.1')
(36, 5.0, '3.2')
(37, 5.5, '3.5')
(38, 4.9, '3.1')
(39, 4.4, '3')
(40, 5.1, '3.4')
(41, 5.0, '3.5')
(42, 4.5, '2.3')
(43, 4.4, '3.2')
(44, 5.0, '3.5')
(45, 5.1, '3.8')
(46, 4.8, '3')
(47, 5.1, '3.8')
(48, 4.6, '3.2')
(49, 5.3, '3.7')
(50, 5.0, '3.3')
(51, 7.0, '3.2')
(52, 6.4, '3.2')
(53, 6.9, '3.1')
(54, 5.5, '2.3')
(55, 6.5, '2.8')
(56, 5.7, '2.8')
(57, 6.3, '3.3')
(58, 4.9, '2.4')
(59, 6.6, '2.9')
(60, 5.2, '2.7')
(61, 5.0, '2')
(62, 5.9, '3')
(63, 6.0, '2.2')
(64, 6.1, '2.9')
(65, 5.6, '2.9')
(66, 6.7, '3.1')
(67, 5.6, '3')
(68, 5.8, '2.7')
(69, 6.2, '2.2')
(70, 5.6, '2.5')
(71, 5.9, '3.2')
(72, 6.1, '2.8')
(73, 6.3, '2.5')
(74, 6.1, '2.8')
(75, 6.4, '2.9')
(76, 6.6, '3')
(77, 6.8, '2.8')
(78, 6.7, '3')
(79, 6.0, '2.9')
(80, 5.7, '2.6')
(81, 5.5, '2.4')
(82, 5.5, '2.4')
(83, 5.8, '2.7')
(84, 6.0, '2.7')
(85, 5.4, '3')
(86, 6.0, '3.4')
(87, 6.7, '3.1')
(88, 6.3, '2.3')
(89, 5.6, '3')
(90, 5.5, '2.5')
(91, 5.5, '2.6')
(92, 6.1, '3')
(93, 5.8, '2.6')
(94, 5.0, '2.3')
(95, 5.6, '2.7')
(96, 5.7, '3')
(97, 5.7, '2.9')
(98, 6.2, '2.9')
(99, 5.1, '2.5')
(100, 5.7, '2.8')
(101, 6.3, '3.3')
(102, 5.8, '2.7')
(103, 7.1, '3')
(104, 6.3, '2.9')
(105, 6.5, '3')
(106, 7.6, '3')
(107, 4.9, '2.5')
(108, 7.3, '2.9')
(109, 6.7, '2.5')
(110, 7.2, '3.6')
(111, 6.5, '3.2')
(112, 6.4, '2.7')
(113, 6.8, '3')
(114, 5.7, '2.5')
(115, 5.8, '2.8')
(116, 6.4, '3.2')
(117, 6.5, '3')
(118, 7.7, '3.8')
(119, 7.7, '2.6')
(120, 6.0, '2.2')
(121, 6.9, '3.2')
(122, 5.6, '2.8')
(123, 7.7, '2.8')
(124, 6.3, '2.7')
(125, 6.7, '3.3')
(126, 7.2, '3.2')
(127, 6.2, '2.8')
(128, 6.1, '3')
(129, 6.4, '2.8')
(130, 7.2, '3')
(131, 7.4, '2.8')
(132, 7.9, '3.8')
(133, 6.4, '2.8')
(134, 6.3, '2.8')
(135, 6.1, '2.6')
(136, 7.7, '3')
(137, 6.3, '3.4')
(138, 6.4, '3.1')
(139, 6.0, '3')
(140, 6.9, '3.1')
(141, 6.7, '3.1')
(142, 6.9, '3.1')
(143, 5.8, '2.7')
(144, 6.8, '3.2')
(145, 6.7, '3.3')
(146, 6.7, '3')
(147, 6.3, '2.5')
(148, 6.5, '3')
(149, 6.2, '3.4')
(150, 5.9, '3')

In [31]:
load_df_2 = pd.read_sql(f"SELECT * FROM {table_name}", conn)

In [33]:
load_df_2.head()

   id  sepallengthcm    sepalwidthcm
0   1            5.1  Three dot Five
1   2            4.9             3.5
2   3            4.7          3.Five
3   4            4.6               3
4   5            5.0               3

### Tabel_4

In [34]:
df4 = pd.read_csv('../data/data_3.csv')

In [35]:
df4.head()

   Id          Species
0  51  Iris-versicolor
1  52  Iris-versicolor
2  53  Iris-versicolor
3  54  Iris-versicolor
4  55  Iris-versicolor

In [37]:
conn = psycopg2.connect(
    host="localhost",
    database="iris",
    user="postgres",
    password="root"
)

# Create a cursor object to execute SQL statements
cursor = conn.cursor()





# Define the table name and column names with their respective data types
table_name = 'data_4'
column1_name = 'Id'
column1_type = 'INTEGER'
column2_name = 'Species'
column2_type = 'VARCHAR(60)'


# Create the table
create_table_query = f'''
    CREATE TABLE {table_name} (
        {column1_name} {column1_type},
        {column2_name} {column2_type}
    )
'''
cursor.execute(create_table_query)

# Commit the changes
conn.commit()

In [38]:
for row in df4.itertuples(index=False):
    insert_query = f'''
        INSERT INTO {table_name} (Id, Species)
        VALUES (%s, %s)
    '''
    cursor.execute(insert_query, row)
conn.commit()

In [39]:
cursor = conn.cursor()
# Define the table name
table_name = 'data_4'

# Select all data from the table
select_query = f"SELECT * FROM {table_name}"
cursor.execute(select_query)

# Fetch all the rows
rows = cursor.fetchall()

# Print the retrieved data
for row in rows:
    print(row)

(51, 'Iris-versicolor')
(52, 'Iris-versicolor')
(53, 'Iris-versicolor')
(54, 'Iris-versicolor')
(55, 'Iris-versicolor')
(56, 'Iris-versicolor')
(57, 'Iris-versicolor')
(58, 'Iris-versicolor')
(59, 'Iris-versicolor')
(60, 'Iris-versicolor')
(61, 'Iris-versicolor')
(62, 'Iris-versicolor')
(63, 'Iris-versicolor')
(64, 'Iris-versicolor')
(65, 'Iris-versicolor')
(66, 'Iris-versicolor')
(67, 'Iris-versicolor')
(68, 'Iris-versicolor')
(69, 'Iris-versicolor')
(70, 'Iris-versicolor')
(71, 'Iris-versicolor')
(72, 'Iris-versicolor')
(73, 'Iris-versicolor')
(74, 'Iris-versicolor')
(75, 'Iris-versicolor')
(76, 'Iris-versicolor')
(77, 'Iris-versicolor')
(78, 'Iris-versicolor')
(79, 'Iris-versicolor')
(80, 'Iris-versicolor')
(81, 'Iris-versicolor')
(82, 'Iris-versicolor')
(83, 'Iris-versicolor')
(84, 'Iris-versicolor')
(85, 'Iris-versicolor')
(86, 'Iris-versicolor')
(87, 'Iris-versicolor')
(88, 'Iris-versicolor')
(89, 'Iris-versicolor')
(90, 'Iris-versicolor')
(91, 'Iris-versicolor')
(92, 'Iris-versicolor')
(93, 'Iris-versicolor')
(94, 'Iris-versicolor')
(95, 'Iris-versicolor')
(96, 'Iris-versicolor')
(97, 'Iris-versicolor')
(98, 'Iris-versicolor')
(99, 'Iris-versicolor')
(100, 'Iris-versicolor')
(101, 'Iris-virginica')
(102, 'Iris-virginica')
(103, 'Iris-virginica')
(104, 'Iris-virginica')
(105, 'Iris-virginica')
(106, 'Iris-virginica')
(107, 'Iris-virginica')
(108, 'Iris-virginica')
(109, 'Iris-virginica')
(110, 'Iris-virginica')
(111, 'Iris-virginica')
(112, 'Iris-virginica')
(113, 'Iris-virginica')
(114, 'Iris-virginica')
(115, 'Iris-virginica')
(116, 'Iris-virginica')
(117, 'Iris-virginica')
(118, 'Iris-virginica')
(119, 'Iris-virginica')
(120, 'Iris-virginica')
(121, 'Iris-virginica')
(122, 'Iris-virginica')
(123, 'Iris-virginica')
(124, 'Iris-virginica')
(125, 'Iris-virginica')
(126, 'Iris-virginica')
(127, 'Iris-virginica')
(128, 'Iris-virginica')
(129, 'Iris-virginica')
(130, 'Iris-virginica')
(131, 'Iris-virginica')
(132, 'Iris-virginica')
(133, 'Iris-virginica')
(134, 'Iris-virginica')
(135, 'Iris-virginica')
(136, 'Iris-virginica')
(137, 'Iris-virginica')
(138, 'Iris-virginica')
(139, 'Iris-virginica')
(140, 'Iris-virginica')
(141, 'Iris-virginica')
(142, 'Iris-virginica')
(143, 'Iris-virginica')
(144, 'Iris-virginica')
(145, 'Iris-virginica')
(146, 'Iris-virginica')
(147, 'Iris-virginica')
(148, 'Iris-virginica')
(149, 'Iris-virginica')
(150, 'Iris-virginica')

In [40]:
load_df_3 = pd.read_sql(f"SELECT * FROM {table_name}", conn)

In [41]:
load_df_3.head()

   id          species
0  51  Iris-versicolor
1  52  Iris-versicolor
2  53  Iris-versicolor
3  54  Iris-versicolor
4  55  Iris-versicolor

### Table_5

In [42]:
df5 = pd.read_csv('../data/data_4_2.csv')

In [43]:
df5.head()

   Id  PetalLengthCm  PetalWidthCm      Species
0   1            1.4           0.2  Iris-setosa
1   2            1.4           0.2  iris-setosa
2   3            1.3           0.2  IRIS-SETOSA
3   4            1.5           0.2   IRISsetosa
4   5            1.4           0.2  IRIS_SETOSA

In [44]:
conn = psycopg2.connect(
    host="localhost",
    database="iris",
    user="postgres",
    password="root"
)

# Create a cursor object to execute SQL statements
cursor = conn.cursor()





# Define the table name and column names with their respective data types
table_name = 'data_5'
column1_name = 'Id'
column1_type = 'INTEGER'
column2_name = 'PetalLengthCm'
column2_type = 'FLOAT'
column3_name = 'PetalWidthCm'
column3_type = 'FLOAT'
column4_name = 'Species'
column4_type = 'VARCHAR(60)'


# Create the table
create_table_query = f'''
    CREATE TABLE {table_name} (
        {column1_name} {column1_type},
        {column2_name} {column2_type},
        {column3_name} {column3_type},
        {column4_name} {column4_type}
    )
'''
cursor.execute(create_table_query)

# Commit the changes
conn.commit()

In [46]:
for row in df5.itertuples(index=False):
    insert_query = f'''
        INSERT INTO {table_name} (Id, PetalLengthCm, PetalWidthCm, Species)
        VALUES (%s, %s, %s, %s)
    '''
    cursor.execute(insert_query, row)
conn.commit()

In [47]:
cursor = conn.cursor()
# Define the table name
table_name = 'data_5'

# Select all data from the table
select_query = f"SELECT * FROM {table_name}"
cursor.execute(select_query)

# Fetch all the rows
rows = cursor.fetchall()

# Print the retrieved data
for row in rows:
    print(row)

(1, 1.4, 0.2, 'Iris-setosa')
(2, 1.4, 0.2, 'iris-setosa')
(3, 1.3, 0.2, 'IRIS-SETOSA')
(4, 1.5, 0.2, 'IRISsetosa')
(5, 1.4, 0.2, 'IRIS_SETOSA')
(6, 1.7, 0.4, 'irisSetosa')
(7, 1.4, 0.3, 'IrisSetosa')
(8, 1.5, 0.2, 'iris-setosa')
(9, 1.4, 0.2, 'iri$-$eto$a')
(10, 1.5, 0.1, 'irisSETOSA')
(11, 1.5, 0.2, 'NaN')
(12, 1.6, 0.2, 'Iris-setesa')
(13, 1.4, 0.1, 'setosa')
(14, 1.1, 0.1, 'Setosa')
(15, 1.2, 0.2, 'SETOSA')
(16, 1.5, 0.4, '$e+osa')
(17, 1.3, 0.4, 'Iris-setosa')
(18, 1.4, 0.3, 'Iris-setosa')
(19, 1.7, 0.3, 'Iris-setosa')
(20, 1.5, 0.3, 'Iris-setosa')
(21, 1.7, 0.2, 'Iris-setosa')
(22, 1.5, 0.4, 'Iris-setosa')
(23, 1.0, 0.2, 'Iris-setosa')
(24, 1.7, 0.5, 'Iris-setosa')
(25, 1.9, 0.2, 'Iris-setosa')
(26, 1.6, 0.2, 'Iris-setosa')
(27, 1.6, 0.4, 'Iris-setosa')
(28, 1.5, 0.2, 'Iris-setosa')
(29, 1.4, 0.2, 'Iris-setosa')
(30, 1.6, 0.2, 'Iris-setosa')
(31, 1.6, 0.2, 'Iris-setosa')
(32, 1.5, 0.4, 'Iris-setosa')
(33, 1.5, 0.1, 'Iris-setosa')
(34, 1.4, 0.2, 'Iris-setosa')
(35, 1.5, 0.1, 'Iris-setosa')
(36, 1.2, 0.2, 'Iris-setosa')
(37, 1.3, 0.2, 'Iris-setosa')
(38, 1.5, 0.1, 'Iris-setosa')
(39, 1.3, 0.2, 'Iris-setosa')
(40, 1.5, 0.2, 'Iris-setosa')
(41, 1.3, 0.3, 'Iris-setosa')
(42, 1.3, 0.3, 'Iris-setosa')
(43, 1.3, 0.2, 'Iris-setosa')
(44, 1.6, 0.6, 'Iris-setosa')
(45, 1.9, 0.4, 'Iris-setosa')
(46, 1.4, 0.3, 'Iris-setosa')
(47, 1.6, 0.2, 'Iris-setosa')
(48, 1.4, 0.2, 'Iris-setosa')
(49, 1.5, 0.2, 'Iris-setosa')
(50, 1.4, 0.2, 'Iris-setosa')

In [48]:
load_df_4 = pd.read_sql(f"SELECT * FROM {table_name}", conn)

In [49]:
load_df_4.head()

   id  petallengthcm  petalwidthcm      species
0   1            1.4           0.2  Iris-setosa
1   2            1.4           0.2  iris-setosa
2   3            1.3           0.2  IRIS-SETOSA
3   4            1.5           0.2   IRISsetosa
4   5            1.4           0.2  IRIS_SETOSA